ABOUT_BOT = """
🤖 Бот для отслеживания номерков к врачам Санкт-Петербурга.
✏ Поддерживает автоматическую запись по критериям
"""

HELP = """
📋 Список доступных команд

/start - Об этом боте
/help - Список доступных команд
/cancel - Отменить текущую операцию

coming soon...
"""

UNKNOWN_COMMAND = """
❌ Неизвестная команда: {command}.
Отменить текущую операцию - /cancel
"""

CANCELED = "✅ Текущая операция отменена"

DISTRICT_SELECT = "📍 Выбери район учреждения"
UNKNOWN_DISTRICT = "❌ Неизвестный район: {district}."

CLINIC_SELECT = "🏥 Выбери учреждение"
UNKNOWN_CLINIC = "❌ Неизвестное учреждение: {clinic}."

SPECIALITY_SELECT = "📃 Выбери специальность"
UNKNOWN_SPECIALITY = "❌ Неизвестная специальность: {speciality}."

DOCTOR_SELECT = "🧑‍⚕️ Выбери врача"
UNKNOWN_DOCTOR = "❌ Неизвестный врач: {doctor}."

APPOINTMENT_SELECT = "🕐 Выбери время"
UNKNOWN_APPOINTMENT = "❌ Неизвестная дата записи: {appointment}."
NO_APPOINTMENTS = "❌ Нет доступных талонов."
